sequential/simpleFoam/Daniel_CasoTlaminar/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-06;
        relTol          1e-06;
        smoother        GaussSeidel;
	nPreSweeps      0;
        nPostSweeps     2;
	cacheAgglomeration on;
	agglomeration   faceAreaPair;
	nCellsInCoarsestLevel 10;
	mergeLevels     1;
    }

    "(U|k|epsilon|R|nuTilda)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-06;
        relTol          1e-6;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
}

relaxationFactors
{   
    fields
    {   
	p               0.3;
    }
    equations
    {
        U               0.7; // 0.9 is more stable but 0.95 more convergent
        k               0.7;
	epsilon         0.7;
	R               0.7;
	nuTilda         0.7;
    }
}


// ************************************************************************* //
